ahtn/keyplus/efm8/efm8/mcu/EFM8BB2/inc/SI_EFM8BB2_Register_Enums.h
#define I2C0CN0_PRELOAD__BMASK     0x04 ///< Preload Disable                                  
#define I2C0CN0_PRELOAD__SHIFT     0x02 ///< Preload Disable                                  
#define I2C0CN0_PRELOAD__ENABLED   0x00 ///< Data bytes must be written into the TX FIFO via  
                                        ///< the I2C0DOUT register before the 8th SCL clock of
                                        ///< the matching slave address byte transfer arrives 
                                        ///< for an I2C read operation.                       
#define I2C0CN0_PRELOAD__DISABLED  0x04 ///< Data bytes need not be preloaded for I2C read    
                                        ///< operations. The data byte can be written to      
                                        ///< I2C0DOUT during interrupt servicing.             
                                                                                              
#define I2C0CN0_TIMEOUT__BMASK     0x08 ///< SCL Low Timeout Enable                           
#define I2C0CN0_TIMEOUT__SHIFT     0x03 ///< SCL Low Timeout Enable                           
#define I2C0CN0_TIMEOUT__DISABLED  0x00 ///< Disable I2C SCL low timeout detection using Timer
                                        ///< 4.                                               
#define I2C0CN0_TIMEOUT__ENABLED   0x08 ///< Enable I2C SCL low timeout detection using Timer 
                                        ///< 4.                                               
                                                                                              
#define I2C0CN0_PINMD__BMASK       0x10 ///< Pin Mode Enable                                  
#define I2C0CN0_PINMD__SHIFT       0x04 ///< Pin Mode Enable                                  
#define I2C0CN0_PINMD__GPIO_MODE   0x00 ///< Set the I2C0 Slave pins in GPIO mode.            
#define I2C0CN0_PINMD__I2C_MODE    0x10 ///< Set the I2C0 Slave pins in I2C mode.             
                                                                                              
#define I2C0CN0_PINDRV__BMASK      0x20 ///< Pin Drive Strength                               
#define I2C0CN0_PINDRV__SHIFT      0x05 ///< Pin Drive Strength                               
#define I2C0CN0_PINDRV__LOW_DRIVE  0x00 ///< SDA and SCL will use low drive strength.         
#define I2C0CN0_PINDRV__HIGH_DRIVE 0x20 ///< SDA and SCL will use high drive strength.        
                                                                                              
//------------------------------------------------------------------------------
// I2C0DIN Enums (I2C0 Received Data @ 0xBC)
//------------------------------------------------------------------------------
#define I2C0DIN_I2C0DIN__FMASK 0xFF ///< I2C0 Received Data
#define I2C0DIN_I2C0DIN__SHIFT 0x00 ///< I2C0 Received Data
                                                           
//------------------------------------------------------------------------------
// I2C0DOUT Enums (I2C0 Transmit Data @ 0xBB)
//------------------------------------------------------------------------------
#define I2C0DOUT_I2C0DOUT__FMASK 0xFF ///< I2C0 Transmit Data
#define I2C0DOUT_I2C0DOUT__SHIFT 0x00 ///< I2C0 Transmit Data
                                                             
//------------------------------------------------------------------------------
// I2C0FCN0 Enums (I2C0 FIFO Control 0 @ 0xAD)
//------------------------------------------------------------------------------
#define I2C0FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define I2C0FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define I2C0FCN0_RXTH__ZERO      0x00 ///< RFRQ will be set anytime new data arrives in the  
                                      ///< RX FIFO (when the RX FIFO is not empty).          
#define I2C0FCN0_RXTH__ONE       0x01 ///< RFRQ will be set if the RX FIFO contains more than
                                      ///< one byte.                                         
                                                                                             
#define I2C0FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define I2C0FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define I2C0FCN0_RFLSH__FLUSH    0x04 ///< Initiate an RX FIFO flush.                        
                                                                                             
#define I2C0FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define I2C0FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define I2C0FCN0_RFRQE__DISABLED 0x00 ///< I2C0 interrupts will not be generated when RFRQ is
                                      ///< set.                                              
#define I2C0FCN0_RFRQE__ENABLED  0x08 ///< I2C0 interrupts will be generated if RFRQ is set. 
                                                                                             
#define I2C0FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define I2C0FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define I2C0FCN0_TXTH__ZERO      0x00 ///< TFRQ will be set when the TX FIFO is empty.       
#define I2C0FCN0_TXTH__ONE       0x10 ///< TFRQ will be set when the TX FIFO contains one or 
                                      ///< fewer bytes.                                      
                                                                                             
#define I2C0FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define I2C0FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define I2C0FCN0_TFLSH__FLUSH    0x40 ///< Initiate a TX FIFO flush.                         
                                                                                             
#define I2C0FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable                    
#define I2C0FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable                    
#define I2C0FCN0_TFRQE__DISABLED 0x00 ///< I2C0 interrupts will not be generated when TFRQ is
                                      ///< set.                                              
#define I2C0FCN0_TFRQE__ENABLED  0x80 ///< I2C0 interrupts will be generated if TFRQ is set. 
                                                                                             
//------------------------------------------------------------------------------
// I2C0FCN1 Enums (I2C0 FIFO Control 1 @ 0xAB)
//------------------------------------------------------------------------------
#define I2C0FCN1_RXE__BMASK     0x04 ///< RX FIFO Empty                                     
#define I2C0FCN1_RXE__SHIFT     0x02 ///< RX FIFO Empty                                     
#define I2C0FCN1_RXE__NOT_EMPTY 0x00 ///< The RX FIFO contains data.                        
#define I2C0FCN1_RXE__EMPTY     0x04 ///< The RX FIFO is empty.                             
                                                                                            
#define I2C0FCN1_RFRQ__BMASK    0x08 ///< Receive FIFO Request                              
#define I2C0FCN1_RFRQ__SHIFT    0x03 ///< Receive FIFO Request                              
#define I2C0FCN1_RFRQ__NOT_SET  0x00 ///< The number of bytes in the RX FIFO is less than or
                                     ///< equal to RXTH.                                    
#define I2C0FCN1_RFRQ__SET      0x08 ///< The number of bytes in the RX FIFO is greater than
                                     ///< RXTH.                                             
                                                                                            
#define I2C0FCN1_TXNF__BMASK    0x40 ///< TX FIFO Not Full                                  
#define I2C0FCN1_TXNF__SHIFT    0x06 ///< TX FIFO Not Full                                  
#define I2C0FCN1_TXNF__FULL     0x00 ///< The TX FIFO is full.                              
#define I2C0FCN1_TXNF__NOT_FULL 0x40 ///< The TX FIFO has room for more data.               
                                                                                            
#define I2C0FCN1_TFRQ__BMASK    0x80 ///< Transmit FIFO Request                             
#define I2C0FCN1_TFRQ__SHIFT    0x07 ///< Transmit FIFO Request                             
#define I2C0FCN1_TFRQ__NOT_SET  0x00 ///< The number of bytes in the TX FIFO is greater than
                                     ///< TXTH.                                             
#define I2C0FCN1_TFRQ__SET      0x80 ///< The number of bytes in the TX FIFO is less than or
                                     ///< equal to TXTH.                                    
                                                                                            
//------------------------------------------------------------------------------
// I2C0FCT Enums (I2C0 FIFO Count @ 0xF5)
//------------------------------------------------------------------------------
#define I2C0FCT_RXCNT__FMASK 0x07 ///< RX FIFO Count
#define I2C0FCT_RXCNT__SHIFT 0x00 ///< RX FIFO Count
                                                    
#define I2C0FCT_TXCNT__FMASK 0x70 ///< TX FIFO Count
#define I2C0FCT_TXCNT__SHIFT 0x04 ///< TX FIFO Count
                                                    
//------------------------------------------------------------------------------
// I2C0SLAD Enums (I2C0 Slave Address @ 0xBD)
//------------------------------------------------------------------------------
#define I2C0SLAD_I2C0SLAD__FMASK 0x7F ///< I2C Hardware Slave Address
#define I2C0SLAD_I2C0SLAD__SHIFT 0x00 ///< I2C Hardware Slave Address
                                                                     
//------------------------------------------------------------------------------
// I2C0STAT Enums (I2C0 Status @ 0xB9)
//------------------------------------------------------------------------------
#define I2C0STAT_RD__BMASK        0x01 ///< I2C Read                                        
#define I2C0STAT_RD__SHIFT        0x00 ///< I2C Read                                        
#define I2C0STAT_RD__NOT_SET      0x00 ///< An I2C Read operation is not in progress.       
#define I2C0STAT_RD__SET          0x01 ///< An I2C Read operation is in progress.           
                                                                                            
#define I2C0STAT_WR__BMASK        0x02 ///< I2C Write                                       
#define I2C0STAT_WR__SHIFT        0x01 ///< I2C Write                                       
#define I2C0STAT_WR__NOT_SET      0x00 ///< An I2C Write operation is not in progress.      
#define I2C0STAT_WR__SET          0x02 ///< An I2C Write operation is in progress.          
                                                                                            
#define I2C0STAT_STOP__BMASK      0x04 ///< Stop                                            
#define I2C0STAT_STOP__SHIFT      0x02 ///< Stop                                            
#define I2C0STAT_STOP__NOT_SET    0x00 ///< A STOP is not pending.                          
#define I2C0STAT_STOP__SET        0x04 ///< A STOP is currently pending for the I2C0 Slave. 
                                                                                            
#define I2C0STAT_START__BMASK     0x08 ///< Start                                           
#define I2C0STAT_START__SHIFT     0x03 ///< Start                                           
#define I2C0STAT_START__NOT_SET   0x00 ///< A START was not detected.                       
#define I2C0STAT_START__SET       0x08 ///< A START is currently pending for the I2C0 Slave.
                                                                                            
#define I2C0STAT_NACK__BMASK      0x10 ///< NACK                                            
#define I2C0STAT_NACK__SHIFT      0x04 ///< NACK                                            
#define I2C0STAT_NACK__NOT_SET    0x00 ///< A NACK did not occur.                           
#define I2C0STAT_NACK__SET        0x10 ///< A NACK occurred.                                
                                                                                            
#define I2C0STAT_I2C0INT__BMASK   0x20 ///< I2C Interrupt                                   
#define I2C0STAT_I2C0INT__SHIFT   0x05 ///< I2C Interrupt                                   
#define I2C0STAT_I2C0INT__NOT_SET 0x00 ///< An interrupt did not occur.                     
#define I2C0STAT_I2C0INT__SET     0x20 ///< An interrupt occurred.                          
                                                                                            
#define I2C0STAT_ACTIVE__BMASK    0x40 ///< Bus Active                                      
#define I2C0STAT_ACTIVE__SHIFT    0x06 ///< Bus Active                                      
#define I2C0STAT_ACTIVE__NOT_SET  0x00 ///< A transfer is not in progress.                  
#define I2C0STAT_ACTIVE__SET      0x40 ///< A transfer is in progress.                      
                                                                                            
