ahtn/keyplus/efm8/efm8/mcu/EFM8BB2/inc/SI_EFM8BB2_Register_Enums.h
#define SMB0CN0_ARBLOST__BMASK      0x04 ///< SMBus Arbitration Lost Indicator               
#define SMB0CN0_ARBLOST__SHIFT      0x02 ///< SMBus Arbitration Lost Indicator               
#define SMB0CN0_ARBLOST__NOT_SET    0x00 ///< No arbitration error.                          
#define SMB0CN0_ARBLOST__ERROR      0x04 ///< Arbitration error occurred.                    
                                                                                             
#define SMB0CN0_ACKRQ__BMASK        0x08 ///< SMBus Acknowledge Request                      
#define SMB0CN0_ACKRQ__SHIFT        0x03 ///< SMBus Acknowledge Request                      
#define SMB0CN0_ACKRQ__NOT_SET      0x00 ///< No ACK requested.                              
#define SMB0CN0_ACKRQ__REQUESTED    0x08 ///< ACK requested.                                 
                                                                                             
#define SMB0CN0_STO__BMASK          0x10 ///< SMBus Stop Flag                                
#define SMB0CN0_STO__SHIFT          0x04 ///< SMBus Stop Flag                                
#define SMB0CN0_STO__NOT_SET        0x00 ///< A STOP is not pending.                         
#define SMB0CN0_STO__SET            0x10 ///< Generate a STOP or a STOP is currently pending.
                                                                                             
#define SMB0CN0_STA__BMASK          0x20 ///< SMBus Start Flag                               
#define SMB0CN0_STA__SHIFT          0x05 ///< SMBus Start Flag                               
#define SMB0CN0_STA__NOT_SET        0x00 ///< A START was not detected.                      
#define SMB0CN0_STA__SET            0x20 ///< Generate a START, repeated START, or a START is
                                         ///< currently pending.                             
                                                                                             
#define SMB0CN0_TXMODE__BMASK       0x40 ///< SMBus Transmit Mode Indicator                  
#define SMB0CN0_TXMODE__SHIFT       0x06 ///< SMBus Transmit Mode Indicator                  
#define SMB0CN0_TXMODE__RECEIVER    0x00 ///< SMBus in Receiver Mode.                        
#define SMB0CN0_TXMODE__TRANSMITTER 0x40 ///< SMBus in Transmitter Mode.                     
                                                                                             
#define SMB0CN0_MASTER__BMASK       0x80 ///< SMBus Master/Slave Indicator                   
#define SMB0CN0_MASTER__SHIFT       0x07 ///< SMBus Master/Slave Indicator                   
#define SMB0CN0_MASTER__SLAVE       0x00 ///< SMBus operating in slave mode.                 
#define SMB0CN0_MASTER__MASTER      0x80 ///< SMBus operating in master mode.                
                                                                                             
//------------------------------------------------------------------------------
// SMB0DAT Enums (SMBus 0 Data @ 0xC2)
//------------------------------------------------------------------------------
#define SMB0DAT_SMB0DAT__FMASK 0xFF ///< SMBus 0 Data
#define SMB0DAT_SMB0DAT__SHIFT 0x00 ///< SMBus 0 Data
                                                     
//------------------------------------------------------------------------------
// SMB0FCN0 Enums (SMBus 0 FIFO Control 0 @ 0xC3)
//------------------------------------------------------------------------------
#define SMB0FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define SMB0FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define SMB0FCN0_RXTH__ZERO      0x00 ///< RFRQ will be set anytime new data arrives in the  
                                      ///< RX FIFO (when the RX FIFO is not empty).          
                                                                                             
#define SMB0FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define SMB0FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define SMB0FCN0_RFLSH__FLUSH    0x04 ///< Initiate an RX FIFO flush.                        
                                                                                             
#define SMB0FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define SMB0FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define SMB0FCN0_RFRQE__DISABLED 0x00 ///< SMBus 0 interrupts will not be generated when RFRQ
                                      ///< is set.                                           
#define SMB0FCN0_RFRQE__ENABLED  0x08 ///< SMBus 0 interrupts will be generated if RFRQ is   
                                      ///< set.                                              
                                                                                             
#define SMB0FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define SMB0FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define SMB0FCN0_TXTH__ZERO      0x00 ///< TFRQ will be set when the TX FIFO is empty.       
                                                                                             
#define SMB0FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define SMB0FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define SMB0FCN0_TFLSH__FLUSH    0x40 ///< Initiate a TX FIFO flush.                         
                                                                                             
#define SMB0FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable                    
#define SMB0FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable                    
#define SMB0FCN0_TFRQE__DISABLED 0x00 ///< SMBus 0 interrupts will not be generated when TFRQ
                                      ///< is set.                                           
#define SMB0FCN0_TFRQE__ENABLED  0x80 ///< SMBus 0 interrupts will be generated if TFRQ is   
                                      ///< set.                                              
                                                                                             
//------------------------------------------------------------------------------
// SMB0FCN1 Enums (SMBus 0 FIFO Control 1 @ 0xC4)
//------------------------------------------------------------------------------
#define SMB0FCN1_RXE__BMASK     0x04 ///< RX FIFO Empty                                     
#define SMB0FCN1_RXE__SHIFT     0x02 ///< RX FIFO Empty                                     
#define SMB0FCN1_RXE__NOT_EMPTY 0x00 ///< The RX FIFO contains data.                        
#define SMB0FCN1_RXE__EMPTY     0x04 ///< The RX FIFO is empty.                             
                                                                                            
#define SMB0FCN1_RFRQ__BMASK    0x08 ///< Receive FIFO Request                              
#define SMB0FCN1_RFRQ__SHIFT    0x03 ///< Receive FIFO Request                              
#define SMB0FCN1_RFRQ__NOT_SET  0x00 ///< The number of bytes in the RX FIFO is less than or
                                     ///< equal to RXTH.                                    
#define SMB0FCN1_RFRQ__SET      0x08 ///< The number of bytes in the RX FIFO is greater than
                                     ///< RXTH.                                             
                                                                                            
#define SMB0FCN1_TXNF__BMASK    0x40 ///< TX FIFO Not Full                                  
#define SMB0FCN1_TXNF__SHIFT    0x06 ///< TX FIFO Not Full                                  
#define SMB0FCN1_TXNF__FULL     0x00 ///< The TX FIFO is full.                              
#define SMB0FCN1_TXNF__NOT_FULL 0x40 ///< The TX FIFO has room for more data.               
                                                                                            
